In [1]:
import sqlite3
conn=sqlite3.connect('Employees.db')
print("database opened")

database opened

In [3]:
# Table 1 Query:
conn.execute('''Create Table EmployeeDetails(
EmployeeID int, 
FirstName varchar(50), 
LastName varchar(50), 
Age int, 
Gender varchar(50)
);''')
conn.commit()

In [4]:
#Table 2 Query:
conn.execute('''Create Table EmployeeSalary(
EmployeeID int, 
JobTitle varchar(50), 
Salary int
);''')
conn.commit()

In [5]:
# Table 1 Insertion Query:
conn.execute('''Insert into EmployeeDetails VALUES
(1001, 'Jim', 'Halpert', 30, 'Male'),
(1002, 'Pam', 'Beasley', 30, 'Female'),
(1003, 'Dwight', 'Schrute', 29, 'Male'),
(1004, 'Angela', 'Martin', 31, 'Female'),
(1005, 'Toby', 'Flenderson', 32, 'Male'),
(1006, 'Michael', 'Scott', 35, 'Male'),
(1007, 'Meredith', 'Palmer', 32, 'Female'),
(1008, 'Stanley', 'Hudson', 38, 'Male'),
(1009, 'Kevin', 'Malone', 31, 'Male');''')
conn.commit()

In [6]:
# Table 2 Insertion Query:
conn.execute('''Insert Into EmployeeSalary VALUES
(1001, 'Salesman', 45000),
(1002, 'Receptionist', 36000),
(1003, 'Salesman', 63000),
(1004, 'Accountant', 47000),
(1005, 'HR', 50000),
(1006, 'Regional Manager', 65000),
(1007, 'Supplier Relations', 41000),
(1008, 'Salesman', 48000),
(1009, 'Accountant', 42000);''')
conn.commit()

In [7]:
# Select query for table1
EmployeeDetails=conn.execute('''select * from EmployeeDetails;''')
for i in EmployeeDetails:
  print(i)

(1001, 'Jim', 'Halpert', 30, 'Male')
(1002, 'Pam', 'Beasley', 30, 'Female')
(1003, 'Dwight', 'Schrute', 29, 'Male')
(1004, 'Angela', 'Martin', 31, 'Female')
(1005, 'Toby', 'Flenderson', 32, 'Male')
(1006, 'Michael', 'Scott', 35, 'Male')
(1007, 'Meredith', 'Palmer', 32, 'Female')
(1008, 'Stanley', 'Hudson', 38, 'Male')
(1009, 'Kevin', 'Malone', 31, 'Male')

In [8]:
# Select query for table2
EmployeeSalary=conn.execute('''select * from EmployeeSalary''')
for i in EmployeeSalary:
  print(i)

(1001, 'Salesman', 45000)
(1002, 'Receptionist', 36000)
(1003, 'Salesman', 63000)
(1004, 'Accountant', 47000)
(1005, 'HR', 50000)
(1006, 'Regional Manager', 65000)
(1007, 'Supplier Relations', 41000)
(1008, 'Salesman', 48000)
(1009, 'Accountant', 42000)

In [9]:
conn.commit()

```
WHERE Query

```
'=' equal

In [13]:
select_equal=conn.execute('''select Age from EmployeeDetails where FirstName="Dwight";''') # '=' is used to print the FirstName which is equals to 'Dwight'
for i in select_Age:
  print(i)

```
'<>'  not equal

In [14]:
select_NotEqual=conn.execute('''select Age from EmployeeDetails where FirstName<>"Dwight";''') # '<>' means not equal
for i in select_Age:
  print(i)

```
'<' less than

In [16]:
select_LessThan=conn.execute('''select Age from EmployeeDetails where Age<"35"''')
for i in select_LessThan:
  print(i)

(30,)
(30,)
(29,)
(31,)
(32,)
(32,)
(31,)

```
'>' greater than

In [17]:
select_GreaterThan=conn.execute('''select Age from EmployeeDetails where Age>"35"''')
for i in select_GreaterThan:
  print(i)

(38,)

```
'and'

In [18]:
select_Name=conn.execute('''select FirstName,LastName from EmployeeDetails where Age="30" and Gender="Male";''')
for i in select_Name:
  print(i)

('Jim', 'Halpert')

```
'or'

In [19]:
select_Name=conn.execute('''select FirstName,LastName from EmployeeDetails where Age="30" or Gender="Male";''')
for i in select_Name:
  print(i)

('Jim', 'Halpert')
('Pam', 'Beasley')
('Dwight', 'Schrute')
('Toby', 'Flenderson')
('Michael', 'Scott')
('Stanley', 'Hudson')
('Kevin', 'Malone')

```
'NULL'

In [21]:
select_Name=conn.execute('''select FirstName,LastName from EmployeeDetails where FirstName is NULL;''')
for i in select_Name:
  print(i)

```
'NOT NULL'

In [22]:
select_Name=conn.execute('''select FirstName,LastName from EmployeeDetails where FirstName is Not NULL;''')
for i in select_Name:
  print(i)

('Jim', 'Halpert')
('Pam', 'Beasley')
('Dwight', 'Schrute')
('Angela', 'Martin')
('Toby', 'Flenderson')
('Michael', 'Scott')
('Meredith', 'Palmer')
('Stanley', 'Hudson')
('Kevin', 'Malone')

```
'in'

In [23]:
select_Name=conn.execute('''select FirstName,LastName from EmployeeDetails where Age in ('29','30');''')
for i in select_Name:
  print(i)

('Jim', 'Halpert')
('Pam', 'Beasley')
('Dwight', 'Schrute')

```
'LIKE'

**'%' is a wildcard**

In [28]:
# J% => every First Name starting with the letter 'J'
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "J%";''')
for i in select_FirstName:
  print(i)

('Jim',)

In [29]:
# %m => every First Name ending with the letter 'm'
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "%m";''')
for i in select_FirstName:
  print(i)

('Jim',)
('Pam',)

In [30]:
# %i% => every First Name that has the letter 'i'
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "%i%";''')
for i in select_FirstName:
  print(i)

('Jim',)
('Dwight',)
('Michael',)
('Meredith',)
('Kevin',)

In [31]:
# J%i% => every First Name starting with the letter 'J' and has 'i' in it
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "J%i%";''')
for i in select_FirstName:
  print(i)

('Jim',)

In [32]:
# M%i%l => every First Name starting with the letter 'M' and has 'i' in it and ends with the letter 'l'
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "M%i%l";''')
for i in select_FirstName:
  print(i)

('Michael',)

In [33]:
# _i% => every First Name starting with any letter andthat have 0 in the second  positions. 
select_FirstName=conn.execute('''select FirstName from EmployeeDetails where FirstName LIKE "_i%";''')
for i in select_FirstName:
  print(i)

('Jim',)
('Michael',)